Revit 2026 API

# ElectricalPhaseLine Enumeration

---

This attribute defines the electrical phase.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ElectricalPhaseLine
```
```vb
Public Enumeration ElectricalPhaseLine
```
```cpp
public enum class ElectricalPhaseLine
```
```fsharp
type ElectricalPhaseLine
```

| Member name | Value | Description |
| --- | --- | --- |
| A | 0 | Phase A |
| B | 1 | Phase B |
| C | 2 | Phase C |
| Invalid | -1 | Not defined. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace